Repository: yeager/libsmbios
Catalog: po/*.po
Languages: sv

source: Show password information
sv: Visa lösenordsinformation

source: Keyboard Scancodes
sv: Tangentbordets skanningskoder

source: User password
sv: Användarens lösenord

source: Admin password
sv: Administratörens lösenord

source: Owner password
sv: Ägarens lösenord

source: ERROR: Could not parse system SMBIOS table.
sv: FEL: Kunde inte tolka systemets SMBIOS-tabell.

source: The smbios library returned this error:
sv: smbios-biblioteket returnerade detta felet:

source: Product Name
sv: Produktnamn

source: Vendor
sv: Tillverkare

source: Service Tag
sv: Servicetagg

source: Express Service Code
sv: Expresstjänstkod

source: Asset Tag
sv: Tillgångstagg

source: Property Ownership Tag
sv: Egenskapens ägarskapstagg

source: Show or set service tag
sv: Visa eller ställ in tjänstetagg

source: Show or set asset tag
sv: Visa eller ställ in tillgångstagg

source: Show or set property tag
sv: Visa eller ställ in egenskapstagg

source: Set specified tag to new value
sv: Ställ in angiven tagg till nytt värde

source: Specify which tag to set.
sv: Ange vilken tagg som ska ställas in.

source: Current tag value:
sv: Aktuellt taggvärde:

source: Setting new tag value: %s
sv: Ställer in nytt taggvärde: %s

source: Action: dump token table
sv: Åtgärd: dumpa token-tabell

source: Action: dump token table in CSV format
sv: Åtgärd: dumpa token-tabellen i CSV-format

source: Action: Restore token settings from CSV table dump
sv: Åtgärd: Återställ tokeninställningar från CSV-tabelldump

source: Action: return true if specified token is a string.
sv: Åtgärd: returnera true om angiven token är en sträng.

source: Action: return true if specified token is a bool.
sv: Åtgärd: returnera true om angiven token är en bool.

source: Action: return true if specified bool token is active.
sv: Åtgärd: returnera true om angivet bool-token är aktivt.

source: Action: get string token value.
sv: Åtgärd: hämta strängtokenvärdet.

source: Action: activate specified bool token.
sv: Åtgärd: aktivera angiven bool-token.

source: Action: set string token value.
sv: Åtgärd: ställ in strängtokenvärde.

source: Filter only token with ID.
sv: Filtrera endast token med ID.

source: Filter only token with name.
sv: Filtrera endast token med namn.

source: Filter only token with setting.
sv: Filtrera endast token med inställning.

source: path to the token.csv file.
sv: sökväg till filen token.csv.

source: Path to token blacklist file.
sv: Sökväg till svartlistningsfilen för tokens.

source: unknown
sv: okänt

source: Ignoring parsing error in CSV file:
sv: Ignorerar tolkningsfel i CSV-fil:

source: Skipping '%s' due to IOError.
sv: Hoppar över '%s' på grund av IOError.

source: The error message was: %s
sv: Felmeddelandet var: %s

source: <weird unknown type>
sv: <konstig okänd typ>

source: <unknown value>
sv: <okänt värde>

source: value: %s = %s
sv: värde: %s = %s

source: Desc:
sv: Beskr:

source: Importing token values from '%s'
sv: Importerar tokenvärden från '%s'

source: File format error. The first line should list the column names. Could not find the %s column
sv: Filformatfel. Den första raden ska innehålla kolumnnamnen. Kunde inte hitta kolumnen %s

source: Cannot continue, exiting.
sv: Kan inte fortsätta, avslutar.

source: Not importing token that is unknown: 0x%04x
sv: Importerar inte okänd token: 0x%04x

source: INFO: token 0x%04x settings file name does not match my DB. Applying setting anyways.
sv: INFO: token 0x%04x inställningsfilens namn stämmer inte överens med min databas. Tillämpar inställningen ändå.

source: settings file: %s
sv: inställningsfil: %s

source: DB name : %s
sv: DB-namn : %s

source: INFO: token 0x%04x settings file setting-name does not match my DB. Applying setting anyways.
sv: INFO: token 0x%04x inställningsfilens inställningsnamn stämmer inte överens med min databas. Tillämpar inställningen ändå.

source: SKIPPING: TYPE MISMATCH. Settings file says token 0x%04x should be bool, but it doesnt pass bool check.
sv: HOPPAR ÖVER: TYPEN STÄMMER INTE. Inställningsfilen anger att token 0x%04x ska vara bool, men det klarar inte bool-kontrollen.

source: Importing setting for token (active): 0x%04x
sv: Importerar inställning för token (aktiv): 0x%04x

source: Token already correct (bool, active): 0x%04x
sv: Token redan korrekt (bool, aktiv): 0x%04x

source: Info: Cannot de-activate tokens, can only activate the contrapositive. (0x%04x == false)
sv: Info: Tokens kan inte inaktiveras, endast kontrapositiva kan aktiveras. (0x%04x == false)

source: Token already correct (bool, inactive): 0x%04x
sv: Token redan korrekt (bool, inaktiv): 0x%04x

source: UNEXPECTED VALUE: Bool token should only ever have values of 'true' or 'false', but token 0x%04x tries to set value '%s'
sv: OVÄNTAT VÄRDE: Bool-token ska endast ha värdena "true" eller "false", men token 0x%04x försöker ställa in värdet "%s"

source: SKIPPING: TYPE MISMATCH. Settings file says token 0x%04x should be string, but it doesnt pass string check.
sv: HOPPAR ÖVER: TYPEN STÄMMER INTE. Inställningsfilen anger att token 0x%04x ska vara en sträng, men den klarar inte strängkontrollen.

source: Importing setting for token (string): 0x%04x
sv: Importerar inställning för token (sträng): 0x%04x

source: Token already correct (string=='%s'): 0x%04x
sv: Token redan korrekt (sträng=='%s'): 0x%04x

source: Not importing token which is inapplicable to this system: 0x%04x
sv: Importerar inte token som inte är tillämpligt för detta system: 0x%04x

source: Not importing blacklisted token 0x%04x. Reason: %s
sv: Importerar inte svartlistad token 0x%04x. Anledning: %s

source: require token-id or token name/setting pair.
sv: kräver token-id eller token-namn/inställningspar.

source: token not found. Name(%s) Setting(%s).
sv: token hittades inte. Namn(%s) Inställning(%s).

source: Original Value
sv: Ursprungligt värde

source: type: %s
sv: typ: %s

source: value: %s
sv: värde: %s

source: Setting string value ...
sv: Ställer in strängvärde ...

source: New value
sv: Nytt värde

source: Activating token...
sv: Aktiverar token...

source: ERROR: Could not manipulate system token.
sv: FEL: Det gick inte att manipulera systemtoken.

source: The token library returned this error:
sv: Tokenbiblioteket returnerade följande felmeddelande:

source: Set wakeup hour. Must be 0-23
sv: Ställ in väckningstid för timme. Måste vara 0-23

source: Set wakeup minute. Must be 0-59
sv: Ställ in väckningstid för minuter. Måste vara 0-59

source: Set wakeup for every day
sv: Ställ in väckning för varje dag

source: Set wakeup for weekdays only
sv: Ställ in väckning endast för vardagar

source: Disable wakeups
sv: Inaktivera väckningar

source: Wakeup hour must be between 0 and 23. You passed: '%s'
sv: Väckningstiden måste vara mellan 0 och 23. Du angav: '%s'

source: Wakeup min must be between 0 and 59. You passed: '%s'
sv: Väckningstiden måste vara mellan 0 och 59. Du angav: '%s'

source: Wakeup disabled
sv: Väckning inaktiverad

source: Wakeup every day
sv: Väck varje dag

source: Wakeup time: %02d:%02d
sv: Väckningstid: %02d:%02d

source: Wakeup weekdays
sv: Väckning vardagar

source: Current wakeup settings:
sv: Aktuella väckningsinställningar:

source: Setting new wakeup time:
sv: Ställer in ny väckningstid:

source: ERROR: This system does not support programmed wakeups.
sv: FEL: Detta system stöder inte programmerade väckningar.

source: Show wireless configuration (default)
sv: Visa trådlös konfiguration (standard)

source: Set BIOS boot-time setting.
sv: Ställ in BIOS-uppstartstid.

source: Do not set BIOS boot-time setting.
sv: Ställ inte in BIOS-uppstartsinställning.

source: Set BIOS runtime setting (default).
sv: Ställ in BIOS-körtid (standard).

source: Do not set BIOS runtime setting.
sv: Ställ inte in BIOS-körtidsinställning.

source: Set radio runtime status for wireless LAN
sv: Ställ in radions driftstillstånd för trådlöst LAN

source: Set radio runtime status for Bluetooth
sv: Ställ in radions driftstillstånd för Bluetooth

source: Set radio runtime status for cellular (wireless WAN)
sv: Ställ in radions driftstillstånd för mobilnät (trådlöst WAN)

source: Set radio runtime status for UWB
sv: Ställ in radions driftstillstånd för UWB

source: Set radio runtime status for WiGig
sv: Ställ in radions driftstillstånd för WiGig

source: Set hardware switch so that it controls radio for wireless LAN
sv: Ställ in hårdvaruknappen så att den kontrollerar radion för trådlöst LAN

source: Set hardware switch so that it controls radio for Bluetooth
sv: Ställ in hårdvaruknappen så att den kontrollerar radion för Bluetooth

source: Set hardware switch so that it controls radio for cellular (wireless WAN)
sv: Ställ in hårdvaruknappen så att den kontrollerar radion för mobilnät (trådlöst WAN)

source: Set hardware switch so that it controls radio for UWB
sv: Ställ in hårdvaruknappen så att den kontrollerar radion för UWB

source: Set hardware switch so that it controls radio for WiGig
sv: Ställ in hårdvaruknappen så att den kontrollerar radion för WiGig

source: Enable or disable the WIFI locator switch
sv: Aktivera eller inaktivera växel för WIFI-locator

source: Get status for wireless LAN. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
sv: Hämta status för trådlöst nätverk. 0 = aktiverat. 1 = inaktiverat. 2 = finns inte. 3 = stöds inte. 4 = okänt.

source: Get status for Bluetooth. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
sv: Hämta status för Bluetooth. 0 = aktiverat. 1 = inaktiverat. 2 = finns inte. 3 = stöds inte. 4 = okänt.

source: Get status for cellular (wireless WAN). 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
sv: Hämta status för mobilnät (trådlöst WAN). 0 = aktiverat. 1 = inaktiverat. 2 = inte tillgängligt. 3 = stöds inte. 4 = okänt.

source: Get status for UWB. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
sv: Hämta status för UWB. 0 = aktiverad. 1 = inaktiverad. 2 = inte tillgängligt. 3 = stöds inte. 4 = okänt.

source: Get status for WiGig. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
sv: Hämta status för WiGig. 0 = aktiverat. 1 = inaktiverat. 2 = inte tillgängligt. 3 = stöds inte. 4 = okänt.

source: Get status for locator switch
sv: Hämta status för locator-växling

source: Set boot settings for %s
sv: Ställ in uppstartsinställningar för %s

source: This system does not support boot time settings for %s
sv: Detta system saknar stöd för inställningar vid uppstartstid för %s

source: Set runtime settings for %s
sv: Ställ in körtidsinställningar för %s

source: Runtime setting has no effect when boot time config is disabled. Ignoring.
sv: Körtidsinställningen har ingen effekt när uppstartskonfigurationen är inaktiverad. Ignoreras.

source: This system does not support runtime control of wireless settings.
sv: Detta system saknar stöd för körtidskontroll av trådlösa inställningar.

source: Set boot switch settings for %s
sv: Ställ in inställningar för uppstartsväxling för %s

source: This system does not support boot-time wireless switch configuration for %s.
sv: Detta system stöder inte konfiguration av trådlös växling vid uppstart för %s.

source: Set runtime switch settings for %s
sv: Ställ in inställningar för körtidsväxling för %s

source: This system does not support runtime control of wireless switch settings.
sv: Detta system saknar stöd för körtidskontroll av inställningar för trådlösa växlingar.

source: Radio Status for %s:
sv: Radiostatus för %s:

source: %s enabled at boot
sv: %s aktiverad vid uppstart

source: %s disabled at boot
sv: %s inaktiverad vid uppstart

source: %s boot-time setting not present
sv: %s inställning för uppstartstid finns inte

source: %s supported
sv: %s stöds

source: %s disabled
sv: %s inaktiverad

source: %s enabled
sv: %s aktiverad

source: %s installed
sv: %s installerad

source: %s not installed
sv: %s inte installerad

source: %s controlled by wireless switch at boot
sv: %s kontrolleras av trådlös brytare vid uppstart

source: %s not controlled by wireless switch at boot
sv: %s kontrolleras inte av trådlös brytare vid uppstart

source: %s boot-time wireless switch setting not present
sv: %s inställning för trådlös växling vid uppstart finns inte

source: %s runtime switch control currently enabled
sv: %s körtidsknappkontroll för närvarande aktiverad

source: %s runtime switch control currently disabled
sv: %s körtidsknappkontroll för närvarande inaktiverad

source: %s not supported
sv: %s stöds inte

source: %s legacy switch enabled
sv: %s äldre switch aktiverad

source: %s legacy switch disabled
sv: %s äldre switch inaktiverad

source: Status Code: %d
sv: Statuskod: %d

source: Wireless Info:
sv: Trådlös information:

source: Hardware switch supported
sv: Hårdvarubrytare stöds

source: Hardware switch not supported
sv: Hårdvarubrytare stöds inte

source: WiFi Locator supported
sv: WiFi-lokalisering stöds

source: WiFi Locator not supported
sv: WiFi-lokalisering stöds inte

source: Wireless Keyboard supported
sv: Trådlöst tangentbord stöds

source: Wireless Keyboard not supported
sv: Trådlöst tangentbord stöds inte

source: NVRAM Size: %d bytes
sv: NVRAM-storlek: %d byte

source: Wireless Switch Configuration
sv: Konfiguration av trådlös växling

source: WLAN switch control: %s
sv: WLAN-växlingskontroll: %s

source: on
sv: på

source: off
sv: av

source: Bluetooth switch control: %s
sv: Bluetooth-brytare: %s

source: WWAN switch control: %s
sv: WWAN-växlingskontroll: %s

source: UWB switch control: %s
sv: UWB-växlingskontroll: %s

source: WiGig switch control: %s
sv: WiGig-växlingskontroll: %s

source: switch config: %s
sv: växlingskonfiguration: %s

source: locked
sv: låst

source: not locked
sv: inte låst

source: WiFi locator: %s
sv: WiFi-lokalisering: %s

source: enabled
sv: aktiverad

source: disabled
sv: inaktiverad

source: WiFi Locator config: %s
sv: WiFi-lokalisatorns konfiguration: %s

source: ERROR: Could not execute SMI.
sv: FEL: Kunde inte köra SMI.

source: The smi library returned this error:
sv: smi-biblioteket returnerade följande felmeddelande:

source: Set new value
sv: Ange nytt värde

source: Set new value to be used while running on battery power
sv: Ställ in nytt värde som ska användas vid drift på batteriström

source: Set new value to be used while running on AC power
sv: Ställ in nytt värde som ska användas vid drift på extern ström

source: Reading current %s mode setting
sv: Läser aktuell %s-lägesinställning

source: current: %s
sv: aktuellt: %s

source: Write new %s mode setting
sv: Skriv ny lägesinställning för %s

source: Battery
sv: Batteri

source: AC
sv: Extern ström

source: LCD Brightness is not settable on this machine using this utility.
sv: LCD-ljusstyrkan kan inte ställas in på den här maskinen med det här verktyget.

source: Could not set value because the password was incorrect
sv: Kunde inte ställa in värdet eftersom lösenordet var felaktigt

source: value outside legal bounds
sv: värde utanför giltiga gränser

source: This will Display the Supported Features for Keyboard illumination
sv: Detta visar de funktioner som stöds för tangentbordsbelysning

source: This will Display the current Status of Keyboard Illumination Settings
sv: Detta visar aktuell status för inställningarna för tangentbordsbelysning

source: Option to set USER Selectable Keyboard Mode
sv: Flagga för att ställa in valbart tangentbordsläge för ANVÄNDARE

source: Option to set Trigger types for Keyboard Illumination
sv: Flagga för att ställa in aktiveringstyper för tangentbordsbelysning

source: Set Keyboard Illumination Timeout Value (battery)
sv: Ställ in tidsgräns för tangentbordsbelysning (batteri)

source: Set Keyboard Illumination Timeout Value (ac)
sv: Ställ in tidsgräns för tangentbordsbelysning (extern ström)

source: Set Keyboard Illumination Level
sv: Ställ in tangentbordets belysningsnivå

source: Set/Get ALS (Ambient Light Sensor Status and Control Level)
sv: Ställ in/hämta ALS (status och kontrollnivå för omgivningsljussensor)

source: Get Keyboard Illumination Capability: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X,res[smi.cbRES4]=0x%X
sv: Hämta förmågor för tangentbordsbelysning: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X,res[smi.cbRES4]=0x%X

source: tCould not retrieve supported USER Selectable Modes
sv: Kunde inte hämta användarvalbara lägen som stöds

source: Supported USER Selectable Modes:
sv: Valbara lägen som stöds för ANVÄNDARE:

source: Option Mode
sv: Flagga Läge

source: Note: some modes might need the keyboard set at specific illumination levels
sv: Observera: vissa lägen kan kräva att tangentbordet ställs in på specifika belysningsnivåer

source: Could not retrieve supported KeyBoard Illumination Capabilities
sv: Kunde inte hämta funktioner för tangentbordsbelysning som stöds

source: Select Keyboard illumination on:
sv: Välj tangentbordsbelysning på:

source: Trigger Type Option
sv: Aktiveringstyp Flagga

source: Eg: to Select Trigger for [Any Keystroke] and [Touchpad activity] specify your option like this 0,1)
sv: Exempel: För att välja aktivering för [Valfri tangenttryckning] och [pekplatteaktivitet] anger du ditt alternativ så här 0,1)

source: Triggers Validated Successfully
sv: Aktiverare validerades ok

source: _set_keyboard_attr Flag error: %s
sv: Flaggfel i _set_keyboard_attr: %s

source: Get Keyboard illumination Current State: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Hämta aktuellt tillstånd för tangentbordsbelysning: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Failed to set Keyboard illumination attributes. Could not read the current settings
sv: Misslyckades med att ställa in attributen för tangentbordsbelysningen. Kunde inte läsa de aktuella inställningarna

source: No valid trigger defined
sv: Ingen giltig aktivering definierad

source: A timeout of zero is not supported
sv: En tidsgräns på noll stöds inte

source: The current mode (Always OFF) might prevent level changes, select a new mode
sv: Det aktuella läget (Alltid AV) kan förhindra nivåändringar. Välj ett nytt läge

source: Setting new params in _set_keyboard_attr : Arg2=0x%X Arg3=0x%X
sv: Ställer in nya parametrar i _set_keyboard_attr : Arg2=0x%X Arg3=0x%X

source: Set Trigger Failed. Failed to write config
sv: Inställning av aktivering misslyckades. Det gick inte att skriva konfiguration

source: New %s parameter set Successfully
sv: Ny %s-parameter ställdes in

source: Error Return Code : cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X
sv: Felreturkod: cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X

source: Error reading keyboard settings.
sv: Fel vid läsning av tangentbordsinställningar.

source: Your Keyboard will illumination on:
sv: Ditt tangentbord tänds:

source: Old Keyboard illumination battery timeout is: %d %s
sv: Gamla tidsgränsen för tangentbordsbelysning på batteri är: %d %s

source: Old Keyboard illumination AC timeout is: %d %s
sv: Gamla tidsgränsen för tangentbordsbelysning på extern ström är: %d %s

source: Invalid Timeout parameters detected
sv: Ogiltiga tidsgränsparametrar upptäcktes

source: Error: Invalid Timeout entry detected
sv: Fel: Ogiltig tidsgräns upptäcktes

source: Timeout value out of range: %d
sv: Tidsgränsvärde utanför intervallet: %d

source: To set timeout value as 45 seconds enter: 45s
sv: För att ställa in tidsgränsvärdet till 45 sekunder, ange: 45s

source: You can specify time out values in s[Seconds], m[Minutes], h[hours], d[days]
sv: Du kan ange tidsgränsvärden i s[sekunder], m[minuter], h[timmar], d[dagar]

source: Timeout value range is 1-63
sv: Tidsgränsvärdet ligger mellan 1 och 63

source: Old Keyboard illumination level is: %d
sv: Gamla belysningsnivån för tangentbordet är: %d

source: Level setting not supported
sv: Nivåinställning stöds inte

source: Value out of range, range is 0-%d
sv: Värdet ligger utanför intervallet, intervallet är 0-%d

source: Current status of KeyBoard Illumination setting on your system:
sv: Aktuell status för inställningen för tangentbordsbelysning på ditt system:

source: Get Keyboard Illumination Configuration: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Hämta konfiguration för tangentbordsbelysning: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Info: Unable to fetch Keyboard Illumination Configuration information: Feature Not supported on this system
sv: Info: Det går inte att hämta information om tangentbordets belysningskonfiguration: Funktionen stöds inte på detta system

source: Error: Detected Invalid Keyboar Illumination mode
sv: Fel: Ogiltigt tangentbordsbelysningsläge upptäckt

source: Failed to read: Ambient Light trigger level
sv: Läsning misslyckades: Aktiveringsnivå för omgivande ljus

source: Ambient Light level to trigger automatic keyboard illumination: 0x%X
sv: Omgivande ljusnivå för att aktivera automatisk tangentbordsbelysning: 0x%X

source: Last known Ambient Light level to trigger automatic keyboard illumination: 0x%X
sv: Senast kända omgivningsljusnivå för att aktivera automatisk tangentbordsbelysning: 0x%X

source: Your Keyboard may not support Keyboard illumination Feature
sv: Ditt tangentbord kanske inte har stöd för funktionen för tangentbordsbelysning

source: Configured mode state:
sv: Konfigurerat lägestillstånd:

source: Keyboard illumination timeout on battery has been set at: %d %s
sv: Tidsgränsen för tangentbordets belysning vid batteridrift har ställts in på: %d %s

source: Keyboard illumination timeout on AC has been set at: %d %s
sv: Tidsgränsen för tangentbordets belysning vid extern strömkälla har ställts in på: %d %s

source: Current setting of ALS value that turns the light on or off: %d
sv: Aktuell inställning av ALS-värdet som tänder eller släcker ljuset: %d

source: Current ALS Reading : %d
sv: Aktuell ALS-avläsning: %d

source: Current keyboard light level : %d
sv: Aktuell tangentbordsbelysningsnivå: %d

source: Capabilities of KeyBoard Illumination on your system:
sv: Förmågor för tangentbordsbelysning på ditt system:

source: Warning:: Your Keyboard may not support Keyboard illumination Feature
sv: Varning:: Ditt tangentbord kanske inte stöder funktionen för tangentbordsbelysning

source: Supported USER Selectable Modes :
sv: Valbara lägen för ANVÄNDARE som stöds:

source: Supported Keyboard illumination type :
sv: Typ av tangentbordsbelysning som stöds:

source: Supports Keyboard illumination on :
sv: Har stöd för tangentbordsbelysning på:

source: Can configure Keyboard illumination timeout unit in :
sv: Kan konfigurera tidsgränsen för tangentbordsbelysning i:

source: Supported Keyboard light brightness levels :
sv: Ljusstyrkenivåer för tangentbordet som stöds:

source: Maximum acceptable seconds timeout value :
sv: Maximalt acceptabelt tidsgränsvärde i sekunder:

source: Maximum acceptable minutes timeout value :
sv: Maximalt acceptabelt tidsgränsvärde i minuter :

source: Maximum acceptable hours timeout value :
sv: Maximalt acceptabelt tidsgränsvärde i timmar :

source: Maximum acceptable days timeout value :
sv: Maximalt acceptabelt tidsgränsvärde i dagar :

source: Error Return Code: cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X cbRES4: 0x%X
sv: Felreturkod: cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X cbRES4: 0x%X

source: Get Ambient Light Sensor(ALS) Status: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Hämta status för omgivningsljussensor (ALS): res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to get ALS settings: Feature Not supported on this system
sv: Kunde inte hämta ALS-inställningar: Funktionen stöds inte på det här systemet
