Repository: yeager/libsmbios
Catalog: po/*.po
Languages: sv

source: Get Ambient Light Sensor(ALS) Brightness Table: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Hämta tabell för ljusstyrka från omgivningsljussensor (ALS): res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to get ALS Brightness Table: Feature Not supported on this system
sv: Kunde inte hämta ALS-ljusstyrketabellen: Funktionen stöds inte på det här systemet

source: ALS high/low limit: %d
sv: ALS hög/låg gräns: %d

source: Invalid parm_str detected
sv: Ogiltig parm_str upptäcktes

source: Set Ambient Light Sensor(ALS) Status: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Ställ in status för omgivningsljussensor (ALS): res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to Set ALS settings
sv: Kunde inte ställa in ALS-inställningar

source: Helper function to print current status of keyboard illumination
sv: Hjälpfunktion för att skriva ut aktuell status för tangentbordsbelysning

source: Setting USER Selectable Keyboard Mode
sv: Ställer in tangentbordsläge valbart av ANVÄNDARE

source: Setting Keyboard illumination Triggers
sv: Ställer in aktivering av tangentbordsbelysning

source: This will Display the Supported Features of USTT and AAC
sv: Detta visar de funktioner som stöds av USTT och AAC

source: This will Display the Thermal Information of a system
sv: Detta visar systemets termiska information

source: Option to set Thermal Mode; balanced, cool-bottom, quiet, performance
sv: Flagga för att ställa in termiskt läge: balanced, cool-bottom, quiet, performance

source: Print all the Available Thermal Information of your system:
sv: Skriv ut all tillgänglig termisk information om ditt system:

source: Get Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X, res[smi.cbRES3]=0x%X
sv: Hämta termisk information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X, res[smi.cbRES3]=0x%X

source: Info: Unable to Get Thermal Information on this system
sv: Info: Kunde inte hämta termisk information om detta system

source: Supported Thermal Modes:
sv: Termiska lägen som stöds:

source: Supported Active Acoustic Controller (AAC) modes:
sv: AAC-lägen (Active Acoustic Controller) som stöds:

source: Supported AAC Configuration type:
sv: AAC-konfigurationstyper som stöds:

source: Get Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Hämta termisk information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Print Current Status of Thermal Information:
sv: Skriv ut aktuell status för termisk information:

source: Current Thermal Modes:
sv: Aktuella termiska lägen:

source: Current Active Acoustic Controller (AAC) Mode:
sv: Aktuellt aktivt läge för akustisk kontroll (AAC):

source: Current Fan Failure Mode:
sv: Aktuellt fläktfelläge:

source: Selected Thermal Mode = %s
sv: Valt termiskt läge = %s

source: Invalid thermal mode option specified: %s, Supported modes : balanced, cool-bottom, quiet, performance
sv: Ogiltig flagga för termiskt läge angiven: %s, Lägen som stöds: balanced, cool-bottom, quiet, performance

source: Set Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
sv: Ställ in termisk information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Set Thermal Information failed: arg2- %x cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X
sv: Inställning av termisk information misslyckades: arg2- %x cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X

source: Thermal Information Set successfully to: %s
sv: Termisk information inställd till: %s

source: You can use smbios-thermal-ctl utlity to control the fan speed
sv: Du kan använda verktyget smbios-thermal-ctl för att styra fläkthastigheten

source: Helper function to Get current Thermal Mode settings
sv: Hjälpfunktion för att hämta aktuella inställningar för termiskt läge

source: Helper function to Set Thermal Mode
sv: Hjälpfunktion för att ställa in termiskt läge

source: Debug: Memory dump file to use instead of physical memory
sv: Felsökning: Minnesdumpfiler som ska användas istället för fysiskt minne

source: Debug: CMOS dump file to use instead of physical cmos
sv: Felsökning: CMOS-dumpfilen som ska användas istället för fysisk CMOS

source: Set Boot To UP Flag to true
sv: Ställ in Boot To UP Flag till true

source: Set Boot To UP Flag to false
sv: Ställ in Boot To UP Flag till false

source: Display libsmbios version information
sv: Visa versionsinformation för libsmbios

source: UP Boot Flag SET
sv: UP-uppstartsflagga INSTÄLLD

source: UP Boot Flag NOT SET
sv: UP-uppstartsflagga INTE INSTÄLLD

source: Dumping CMOS index(%d) data(%d)
sv: Dumpning av CMOS-index(%d) data(%d)

source: error opening dump file "%s": %m
sv: fel vid öppning av dumpfilen "%s": %m

source: could not allocate memory: %m
sv: kunde inte allokera minne: %m

source: could not read from memory: %m
sv: kunde inte läsa från minnet: %m

source: could not write to "%s": %m
sv: kunde inte skriva till "%s": %m

source: OEM String %d: %s
sv: OEM-sträng %d: %s

source: Error getting the System ID: unknown error.
sv: Fel vid hämtning av system-ID: okänt fel.

source: Service Tag: %s
sv: Servicetagg: %s

source: Express Service Code: %lld
sv: Expresstjänstkod: %lld

source: Error getting the Service Tag: unknown error
sv: Fel vid hämtning av servicetaggen: okänt fel

source: Asset Tag: %s
sv: Tillgångstagg: %s

source: Error getting the Asset Tag: unknown error
sv: Fel vid hämtning av tillgångstagg: okänt fel

source: Product Name: %s
sv: Produktnamn: %s

source: Error getting the System Name: unknown error.
sv: Fel vid hämtning av systemnamn: okänt fel.

source: Error getting the BIOS Version: unknown error.
sv: Fel vid hämtning av BIOS-version: okänt fel.

source: Vendor: %s
sv: Tillverkare: %s

source: Error getting the Vendor: unknown error.
sv: Fel vid hämtning av tillverkare: okänt fel.

source: Is Dell: %d
sv: Är Dell: %d

source: Set CMOS state byte to new value
sv: Ställ in CMOS-tillståndsbyte till nytt värde

source: Set state byte owner
sv: Ställ in ägare för tillståndsbyte

source: State Byte: 0x%04x
sv: Tillståndsbyte: 0x%04x

source: There was an allocation failure while trying to construct the cmos object.
sv: Det uppstod ett allokeringsfel vid försöket att skapa cmos-objektet.

source: Error trying to raise IO Privilege level.
sv: Fel vid försök att höja IO-behörighetsnivån.

source: The OS Error string was:
sv: OS-felsträngen var:

source: This message should be localized if setlocale() has been called and gettext compiled in.
sv: Detta meddelande bör lokaliseras om setlocale() har anropats och gettext har kompilerats in.

source: File size is too small: File:
sv: Filstorleken är för liten: Fil:

source: Could not (re)open file. File:
sv: Kunde inte (åter)öppna filen. Fil:

source: The mmap() call returned mapping of -1 (failure). File:
sv: mmap()-anropet returnerade mappningen -1 (fel). Fil:

source: The OS Error string was:
sv: OS-felsträngen var:

source: There was an allocation failure while trying to construct the memory object. Filename:
sv: Det uppstod ett allokeringsfel när minnesobjektet skulle skapas. Filnamn:

source: File open error during memory object construction. The filename:
sv: Fel vid öppning av fil under konstruktion av minnesobjekt. Filnamnet:

source: Allocation error trying to allocate memory for error string. (ironic, yes?)
sv: Allokeringsfel vid försök att allokera minne för felsträng. (ironiskt, eller hur?)

source: Could not instantiate SMBIOS table. The errors from the low-level modules were:
sv: Kunde inte instansiera SMBIOS-tabellen. Felen från lågnivåmodulerna var:

source: Failed to find appropriate SMBIOS 0xD4 structure.
sv: Misslyckades med att hitta lämplig SMBIOS 0xD4-struktur.

source: Failed to allocate memory for error string.
sv: Misslyckades med att allokera minne för felsträngen.

source: There was an error trying to perform the smi execute() cmd. Is the 'dcdbas' kernel module loaded?
sv: Det uppstod ett fel vid försöket att utföra kommandot smi execute(). Är kärnmodulen 'dcdbas' inläst?

source: error reading cmos. Lowlevel returned:
sv: fel vid läsning av CMOS. Lågnivå returnerad:

source: Error trying to read cmos. Lowlevel returned:
sv: Fel vid försök att läsa cmos. Lowlevel returnerade:

source: error trying to write cmos. Lowlevel returned:
sv: fel vid försök att skriva cmos. Lowlevel returnerade:

source: Error while trying to write cmos. Lowlevel error was:
sv: Fel vid försök att skriva cmos. Lågnivåfelet var:

source: Error trying to set up CMOS checksum routines.
sv: Fel vid försök att konfigurera rutiner för CMOS-kontrollsumma.

source: Allocation failure while trying to create token object.
sv: Allokeringsfel vid försök att skapa tokenobjekt.

source: Failed to obtain smbios table.
sv: Misslyckades med att hämta smbios-tabellen.

source: Memory allocation failure allocating error string.
sv: Minneallokeringsfel vid allokering av felsträng.

source: Error while trying to add 0xD4 tokens.
sv: Fel vid försök att lägga till 0xD4-tokens.

source: null pointer returned
sv: null-pekare returnerad

source: function returned error value of zero
sv: funktionen returnerade felvärdet noll

source: function returned negative error code
sv: funktionen returnerade negativ felkod

source: hit end of table.
sv: träffade tabellslut.

source: No SMBIOS structure found with handle %s
sv: Ingen SMBIOS-struktur hittades med handtaget %s

source: No SMBIOS structure found with type %s
sv: Ingen SMBIOS-struktur hittades med typen %s

source: SMI executed but returned error
sv: SMI kördes men returnerade fel

source: SMI is unsupported
sv: SMI stöds inte

source: SMI did not execute
sv: SMI kördes inte

source: The output buffer the BIOS requires is in the wrong format
sv: Den utdatabuffert som BIOS kräver har fel format

source: The output buffer the BIOS requires is too small
sv: Den utdatabuffert som BIOS kräver är för liten

source: Could not determine System ID.
sv: Kunde inte fastställa system-ID.

source: Cannot dereference NULL ID
sv: Kan inte avreferera NULL-ID

source: SMBIOS Token ID 0x%04x not found
sv: SMBIOS-token-ID 0x%04x hittades inte
